micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
/*******************************************************************************/
// network API

STATIC mp_obj_t network_ifx_wcm_deinit(mp_obj_t self_in) {
    uint32_t ret = cy_wcm_deinit();
    wcm_assert_raise("network deinit error (code: %d)", ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_deinit_obj, network_ifx_wcm_deinit);

STATIC mp_obj_t network_ifx_wcm_active(size_t n_args, const mp_obj_t *args) {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
        }
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_ap_up());
        } else {
            if (mp_obj_is_true(args[1])) {
                cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
                ret = cy_wcm_start_ap(ap_conf);
                wcm_assert_raise("network ap active error (with code: %d)", ret);
            } else {
                ret = cy_wcm_stop_ap();
                wcm_assert_raise("network ap deactivate error (with code: %d)", ret);
            }
        }
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_active_obj, 1, 2, network_ifx_wcm_active);

typedef struct
{
    mp_obj_t *scan_list;
    cy_wcm_scan_status_t status;
}scan_user_data_t;

// Based on the scan result, get micropython defined equivalent security type (possible value 0-4, extended till 7 to include all cases) and security string (mapped to IFX stack)
uint8_t get_mpy_security_type(cy_wcm_security_t wcm_sec) {
    uint8_t mpy_sec_type = NET_IFX_WCM_SEC_UNKNOWN;

    switch (wcm_sec)
    {
        case CY_WCM_SECURITY_OPEN:
            mpy_sec_type = NET_IFX_WCM_SEC_OPEN;
            break;
        case CY_WCM_SECURITY_WEP_PSK:
        case CY_WCM_SECURITY_WEP_SHARED:
        case CY_WCM_SECURITY_IBSS_OPEN:
            mpy_sec_type = NET_IFX_WCM_SEC_WEP;
            break;
        case CY_WCM_SECURITY_WPA_AES_PSK:
        case CY_WCM_SECURITY_WPA_MIXED_PSK:
        case CY_WCM_SECURITY_WPA_TKIP_PSK:
        case CY_WCM_SECURITY_WPA_TKIP_ENT:
        case CY_WCM_SECURITY_WPA_AES_ENT:
        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA;
            break;
        case CY_WCM_SECURITY_WPA2_AES_PSK:
        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
        case CY_WCM_SECURITY_WPA2_FBT_PSK:
        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
        case CY_WCM_SECURITY_WPA2_AES_ENT:
        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA2;
            break;
        case CY_WCM_SECURITY_WPA2_WPA_AES_PSK:
        case CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA_WPA2;
            break;
        case CY_WCM_SECURITY_WPA3_SAE:
        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA3;
            break;
        case CY_WCM_SECURITY_WPS_SECURE:
        case CY_WCM_SECURITY_UNKNOWN:
        default:
            mpy_sec_type = NET_IFX_WCM_SEC_UNKNOWN;
            break;
    }
    return mpy_sec_type;
}

// Callback function for scan method. After each scan result, the scan callback is executed.
static void network_ifx_wcm_scan_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status) {
    scan_user_data_t *scan_user_data = (scan_user_data_t *)user_data;
    mp_obj_t scan_list = MP_OBJ_FROM_PTR(scan_user_data->scan_list);
    uint8_t hidden_status = 1; // HIDDEN
    uint8_t security_type = NET_IFX_WCM_SEC_OPEN;

    if (status == CY_WCM_SCAN_INCOMPLETE) {
        // Get the network status : hidden(1) or open(0)
        if (strlen((const char *)result_ptr->SSID) != 0) {
            hidden_status = 0;
        }

        // Get security type as mapped in micropython function description
        security_type = get_mpy_security_type(result_ptr->security);

        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(result_ptr->SSID, strlen((const char *)result_ptr->SSID)),
            mp_obj_new_bytes(result_ptr->BSSID, CY_WCM_MAC_ADDR_LEN),
            MP_OBJ_NEW_SMALL_INT(result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(security_type),
            MP_OBJ_NEW_SMALL_INT(hidden_status)
        };
        mp_obj_list_append(scan_list, mp_obj_new_tuple(6, tuple));
    }

    scan_user_data->status = status;
}

STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_scan_filter_t scan_filter;
    bool is_filter_used = false;

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }

    if (n_args != 1) {
        mp_raise_TypeError(MP_ERROR_TEXT("network scan accepts no query parameters"));
    }

    if (kwargs->used != 0) {
        if (kwargs->alloc != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("network scan only accepts one filter mode"));
        }

        is_filter_used = true;
        mp_map_elem_t *e = &kwargs->table[0];
        switch (mp_obj_str_get_qstr(e->key))
        {
            case MP_QSTR_ssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
                size_t len;
                const char *ssid = mp_obj_str_get_data(e->value, &len);
                len = MIN(len, CY_WCM_MAX_SSID_LEN + 1);
                memcpy(scan_filter.param.SSID, ssid, len);
                memset(&scan_filter.param.SSID[len], 0, 1); // null terminated str.
                break;
            }

            case MP_QSTR_bssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
                mp_buffer_info_t bssid;
                mp_get_buffer(e->value, &bssid, MP_BUFFER_READ);
                if (bssid.len != CY_WCM_MAC_ADDR_LEN) {
                    mp_raise_ValueError(MP_ERROR_TEXT("bssid address invalid length"));
                }
                memcpy(scan_filter.param.BSSID, bssid.buf, bssid.len);
                break;
            }

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
        }
    }

    mp_obj_t network_list = mp_obj_new_list(0, NULL);
    scan_user_data_t scan_user_params;
    scan_user_params.scan_list = MP_OBJ_TO_PTR(network_list);
    scan_user_params.status = CY_WCM_SCAN_INCOMPLETE;

    cy_wcm_scan_filter_t *scan_filter_ptr = NULL;
    if (is_filter_used) {
        scan_filter_ptr = &scan_filter;
    }

